export const ADMIN_USERNAME = "מנהל";

export const categorySizes = {
  "חולצת תלבושת": Array.from({ length: 29 }, (_, index) => 4 + index * 2)
    .filter((size) => size < 22 || size > 32)
    .map(String),
  "סרפן סיני": ["6", "7", "8", "9", "10", "12", "14", "16"],
  "סרפן קנדי": ["6X", "6", "7", "8", "9", "10", "12", "14", "16"],
  "חצאית סיני": Array.from({ length: 18 }, (_, index) => String(4 + index * 2)),
  "חצאית קנדי": Array.from({ length: 18 }, (_, index) => String(4 + index * 2)),
  "סוודר זול": ["0", "1", "2", "3", "4", "5", "6", "7"],
  "סוודר יקר": ["P", "XXS", "XS", "S", "M", "L", "XL", "XXL"],
  אחר: ["S", "M", "L", "XL"],
};

export const categoryProducts = {
  "חולצת תלבושת": ["חולצה כחול לבן", "חולצה לבן"],
  "סרפן סיני": ["סרפן סיני"],
  "סרפן קנדי": ["סרפן קנדי"],
  "חצאית סיני": ["חצאית סיני"],
  "חצאית קנדי": ["חצאית קנדי"],
  "סוודר זול": ["סוודר זול"],
  "סוודר יקר": ["סוודר יקר"],
  אחר: ["מוצר כללי"],
};
